tutorials/shockTube_psiThermo/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     hephaestusFoam;

solver          GasHephaestus;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.015;

deltaT          1e-9;

writeControl    adjustableRunTime;

writeInterval   0.001;

cycleWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.25;

maxDeltaT       1;


// ************************************************************************* //
